УправлениеДомашнимиРасходами/src/Documents/ПокупкаТоваров/ПокупкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаТоваров</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СумммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеДомашнимиРасходами/src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>КоммунальныеПлатежи</name>
  </enumValues>
</mdclass:Enum>

УправлениеДомашнимиРасходами/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеДомашнимиРасходами/src/Documents/ПокупкаТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ПВидНомеклатуры = Перечисления.ВидНоменклатуры.Товар;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыТоварОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Для Каждого строка из Объект.Товары Цикл 
		Если строка.Товар = ВыбранноеЗначение Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Этот товар уже есть в списке товаров!";
			Сообщение.УстановитьДанные(строка);
			Сообщение.Поле("Номенклатура");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульПокупкиВызовСервера.ПолучитьЕд_измПоСсылкеНаТовар(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = Текст*ТекущиеДанные.Количество;
	ПересчетСуммыДокумента()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанныые = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныые.Сумма = Текст*ТекущиеДанныые.Цена;
	ПересчетСуммыДокумента();
КонецПроцедуры

//Обработка фильтрации Номенклатуры по виду номенклатуры при выборе Товара
&НаКлиенте
Процедура ТоварыТоварНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора =  Новый Структура("Ссылка",ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНомеклатуры));
	ПараметрыФормы = Новый Структура("Отбор",ЗначениеОтбора);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если СтрДлина(Текст)>2 Тогда 
		ДанныеВыбора = Новый СписокЗначений();
		СписокТоваров = ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНомеклатуры,"%" +Текст + "%");
		ДанныеВыбора.ЗагрузитьЗначения(СписокТоваров);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПересчетСуммыДокумента()
	 СумммаДокумента =0;
	Для каждого товар из Объект.Товары Цикл 
		СумммаДокумента= СумммаДокумента + товар.Сумма;
	КонецЦикла;
	Объект.СумммаДокумента = СумммаДокумента;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции




#КонецОбласти
